app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles" ORDER BY id ASC

  def create
    #render plain:params[:article].inspect
    #Above is for checking it out.
    @article =Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"